Fixed rendering issues for layout.
